#+BLOG: sdowney
#+POSTID: 164
#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:nil arch:headline author:t c:nil
#+OPTIONS: creator:comment d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t
#+OPTIONS: num:t p:nil pri:nil stat:t tags:t tasks:t tex:t timestamp:t toc:nil
#+OPTIONS: todo:t |:t
#+TITLE: spingate
#+DATE: <2016-10-29 Sat>
#+AUTHOR: Steve Downey
#+EMAIL: sdowney@sdowney.org
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 24.5.1 (Org mode 8.3.6)
#+OPTIONS: html-link-use-abs-url:nil html-postamble:auto html-preamble:t
#+OPTIONS: html-scripts:t html-style:t html5-fancy:nil tex:t
#+HTML_DOCTYPE: xhtml-strict
#+HTML_CONTAINER: div
#+DESCRIPTION:
#+KEYWORDS:
#+HTML_LINK_HOME:
#+HTML_LINK_UP:
#+HTML_MATHJAX:
#+HTML_HEAD: <link href="http://sdowney.org/css/smd-zenburn.css" rel="stylesheet"></link>
#+HTML_HEAD_EXTRA:
#+SUBTITLE:
#+INFOJS_OPT:
#+LATEX_HEADER:
#+BABEL: :results output graphics :tangle yes
#+STARTUP: showeverything

* Building and Running

This is a minimal CMake file for building with the system compiler.

#+HEADERS: :tangle CMakeLists.txt :exports code :eval never
#+BEGIN_SRC cmake
cmake_minimum_required(VERSION 3.5)
set(CMAKE_LEGACY_CYGWIN_WIN32 0)

project(SpinGate C CXX)

set(THREADS_PREFER_PTHREAD_FLAG ON)
find_package(Threads REQUIRED)

set(CMAKE_EXPORT_COMPILE_COMMANDS ON)

set(CMAKE_CXX_FLAGS "${CMAKE_CXX_FLAGS} -std=c++14 -ftemplate-backtrace-limit=0")
set(CMAKE_CXX_FLAGS "${CMAKE_CXX_FLAGS} -Wall -Wextra -march=native")
set(CMAKE_CXX_FLAGS_DEBUG "-O0 -fno-inline -g3")
set(CMAKE_CXX_FLAGS_RELEASE "-Ofast -g0 -DNDEBUG")

include_directories(${CMAKE_CURRENT_SOURCE_DIR})

add_executable(spingate main.cpp spingate.cpp)
add_executable(cvgate cvmain.cpp cvgate.cpp)
target_link_libraries(spingate Threads::Threads)
target_link_libraries(cvgate Threads::Threads)
#+END_SRC

And here we build a release version of the test executable:

#+NAME: make-clean
#+BEGIN_SRC shell :exports both :results output
mkdir -p build
cd build
cmake -DCMAKE_BUILD_TYPE=Release ../
make
#+END_SRC

#+RESULTS: make-clean
#+begin_example
-- Configuring done
-- Generating done
-- Build files have been written to: /home/sdowney/src/spingate/build
Scanning dependencies of target cvgate
[ 16%] Building CXX object CMakeFiles/cvgate.dir/cvmain.cpp.o
[ 33%] Building CXX object CMakeFiles/cvgate.dir/cvgate.cpp.o
[ 50%] Linking CXX executable cvgate
[ 50%] Built target cvgate
Scanning dependencies of target spingate
[ 66%] Building CXX object CMakeFiles/spingate.dir/main.cpp.o
[ 83%] Building CXX object CMakeFiles/spingate.dir/spingate.cpp.o
[100%] Linking CXX executable spingate
[100%] Built target spingate
#+end_example

#+NAME: run-main
#+BEGIN_SRC shell :exports results :results output
./build/spingate
#+END_SRC


#+NAME: run-cvmain
#+BEGIN_SRC shell :exports results :results output
./build/cvgate
#+END_SRC

